win95/RTOS-STM32f407/main.c
//	if(strncmp(BufferCom3,"R21x",4)==0)	// active relay 1 and 4
//	{
//		flag_R11x=1;
//		flag_R22=1;
//		timerdk1 =0;
//		timerdk4 =0;
//	}
	
//	if(strncmp(BufferCom3,"R12",3)==0)	// active relay 3
//	{
//		flag_R12=1;
//		timerdk3 =0;
//	}
	
//	if(strncmp(BufferCom3,"R11",3)==0)	// active relay 4
//	{
//		flag_R22=1;
//		timerdk4 =0;
//	}
//	if(strncmp(BufferCom3,"R31",3)==0)	// active relay 2
//	{
//		flag_R31=1;
//		timerdk2 =0;
//	}

		if(flag_R10){		// active relay 1
		turn_on_dk1();
	}
		if(flag_R20){	// active relay 2
		turn_on_dk2();
	}
		if(flag_R11){	// active relay 3
		turn_on_dk3();
	}
		if(flag_R21){	// active relay 4
		turn_on_dk4();
	}
	/* xu li flag_R11 - dk1 tu com1*/
	if(flag_R11x){
		//turn_on_dk1();
	}
	/* xu li flag_R31 - dk2 tu com1*/
	if(flag_R31){
		turn_on_dk2();
	}
/* xu li flag_R21 - dk1 tu com1*/
	if(flag_R21x){
		//turn_on_dk1();
	}
/* xu li flag_R12 - dk3 tu com1*/
	if(flag_R12){
		turn_on_dk3();
	}
/* xu li flag_R22 - dk4 tu com1*/
	if(flag_R22){
		turn_on_dk4();
	}
	
/*Update time*/

	if(flag_R11x||flag_W1D0||flag_R21x||flag_R10) timer_dk1 = timerdk1/2;

	if(flag_R31||flag_W1D1||flag_R20) timer_dk2 = timerdk2/2;

	if(flag_R12||flag_R11 ||flag_W1D0) timer_dk3 = timerdk3;

	if(flag_R22||flag_R21 ||flag_W1D1) timer_dk4 = timerdk4;

}

void 	WaitPC(unsigned int t){
	unsigned long int n=0;
	while(n<=t){
		vTaskDelay(10);
	if(flag_PC==1)
		{
			break;
		}
	n++;
	}
}
void 	TM_USART3_ReceiveHandler(uint8_t c) {	// PC
	static uint8_t cnt=0;
	if(c=='R')cnt=0;
	BufferCom3[cnt]=c;
	if(cnt==2)flag_test=1;
	if((cnt==2)&&(Process==1))flag_PC=1;
	if(cnt<48)cnt++;
	else cnt =0;
	
//	//		/* Try to make a new connection, port 80 */
//	if (TM_ETHERNETCLIENT_Connect("server",192,168,1,108,8081, "./index.txt") != TM_ETHERNET_Result_Ok) {
//	}
}
void 	TM_USART6_ReceiveHandler(uint8_t c) {	// RFID1
	static uint8_t cnt=0;
	if(c==0xBD)cnt=0;
	BufferCom1[cnt]=c;
	if((BufferCom1[3]==0x00)&&(cnt==BufferCom1[3]+1)&&cnt)
	{
		if(Process==0)flag_RFID1=1;
		memset(BufferCom1,'\0',0);
	}
	if(cnt<48)cnt++;

}


uint16_t TM_ETHERNETCLIENT_CreateHeadersCallback(TM_TCPCLIENT_t* connection, char* buffer, uint16_t buffer_length) {
	/* Create request headers */
//	sprintf(buffer, "GET /index.txt?number=%d HTTP/1.1\r\n", *(uint16_t *)connection->user_parameters);
//	sprintf(buffer, "number=%d\r\n", *(uint16_t *)connection->user_parameters);
//	strcat(buffer, "Host: stm32f4-discovery.com\r\n");
//	strcat(buffer, "Connection: close\r\n");
//	strcat(buffer, "\r\n");
//	sprintf(buffer,"\r\n");
//sprintf(buffer,"./index.txt");
	sprintf(buffer,"%s",data_tcp);
/* Return number of bytes in buffer */
	return strlen(buffer);
}

void TM_ETHERNETCLIENT_ReceiveDataCallback(TM_TCPCLIENT_t* connection, uint8_t* buffer, uint16_t buffer_length, uint16_t total_length) {
	uint16_t i = 0;
	
	/* We have available data for connection to receive */
	sprintf(str,"Receiveing %d bytes of data from %s\n", buffer_length, connection->name);
	printf_d(str);
	
//	/* Go through entire buffer, remove response headers */
//	if (connection->headers_done == 0) {
//		for (i = 0; i < buffer_length; i++) {
//			if (
//				buffer[i] == '\r' &&
//				buffer[i + 1] == '\n' &&
//				buffer[i + 2] == '\r' &&
//				buffer[i + 3] == '\n'
//			) {
//				/* Headers done */
//				connection->headers_done = 1;
//				/* Increase i */
//				i += 3;
//				/* Break */
//				break;
//			}
//		}
//	}
	
	/* Print data */
	for (; i < buffer_length; i++) {
		/* Print response */
		sprintf(str,"%c", buffer[i]);
		printf_d(str);
	}
}

void TM_ETHERNETCLIENT_ConnectedCallback(TM_TCPCLIENT_t* connection) {
	/* We are connected */
	sprintf(str,"We are connected to %s\n", connection->name);
	printf_d(str);
}

void TM_ETHERNETCLIENT_ConnectionClosedCallback(TM_TCPCLIENT_t* connection, uint8_t success) {
	/* We are disconnected, done with connection */
	if (success) {
	sprintf(str,"Connection %s was successfully closed. Number of active connections: %d\n", connection->name, *connection->active_connections_count);
	printf_d(str);
	} 
	else {
	sprintf(str,"Connection %s was closed because of error. Number of active connections: %d\n", connection->name, *connection->active_connections_count);
	printf_d(str);
	}	
	/* Increase number of requests */
	requests_count++;
}

void TM_ETHERNETCLIENT_ErrorCallback(TM_TCPCLIENT_t* connection) {
	/* Print to user */
	sprintf(str,"An error occured on connection %s\n", connection->name);
	printf_d(str);
}

void TM_ETHERNETCLIENT_ConnectionStartedCallback(TM_TCPCLIENT_t* connection) {
	/* Print to user */
	sprintf(str,"Connection %s has started\n", connection->name);
	printf_d(str);
}

/* DNS has IP */
void TM_ETHERNETDNS_FoundCallback(char* host_name, uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4) {
	/* If host name is stm32f4-discovery.com */
	if (strstr(host_name, "stm32f4-discovery.com")) {
		/* We have IP */
		MyDNS.HaveIP = 1;
		/* Save IP */
		MyDNS.ip[0] = ip_addr1;
		MyDNS.ip[1] = ip_addr2;
		MyDNS.ip[2] = ip_addr3;
		MyDNS.ip[3] = ip_addr4;
		/* We are not working anymore */
		MyDNS.Working = 0;
		
		/* Print to user */
		sprintf(str,"We have IP address for %s: %d.%d.%d.%d\n", host_name, ip_addr1, ip_addr2, ip_addr3, ip_addr4);
		printf_d(str);
	}
}

/* DNS error callback */
void TM_ETHERNETDNS_ErrorCallback(char* host_name) {
	/* If host name is stm32f4-discovery.com */
	if (strstr(host_name, "stm32f4-discovery.com")) {
		/* We have IP */
		MyDNS.HaveIP = 0;
		/* We are not working anymore */
		MyDNS.Working = 0;
	}
	/* Print to user */
	sprintf(str,"DNS has failed to get IP address for %s\n", host_name);
	printf_d(str);
}

void TM_ETHERNET_IPIsSetCallback(uint8_t ip_addr1, uint8_t ip_addr2, uint8_t ip_addr3, uint8_t ip_addr4, uint8_t dhcp) {
	/* Called when we have valid IP, it might be static or DHCP */
	
	if (dhcp) {
		/* IP set with DHCP */
		sprintf(str,"IP: %d.%d.%d.%d assigned by DHCP server\n", ip_addr1, ip_addr2, ip_addr3, ip_addr4);
		printf_d(str);
	} else {
		/* Static IP */
		sprintf(str,"IP: %d.%d.%d.%d; STATIC IP used\n", ip_addr1, ip_addr2, ip_addr3, ip_addr4);
		printf_d(str);
	}
	
	/* Print MAC address to user */
	sprintf(str,"MAC: %02X-%02X-%02X-%02X-%02X-%02X\n",
		TM_ETHERNET_GetMACAddr(0),
		TM_ETHERNET_GetMACAddr(1),
		TM_ETHERNET_GetMACAddr(2),
		TM_ETHERNET_GetMACAddr(3),
		TM_ETHERNET_GetMACAddr(4),
		TM_ETHERNET_GetMACAddr(5)
	);
	sprintf(str,"MAC: %02X-%02X-%02X-%02X-%02X-%02X\n",
		TM_ETHERNET_GetMACAddr(0),
		TM_ETHERNET_GetMACAddr(1),
		TM_ETHERNET_GetMACAddr(2),
		TM_ETHERNET_GetMACAddr(3),
		TM_ETHERNET_GetMACAddr(4),
		TM_ETHERNET_GetMACAddr(5)
	);
	printf_d(str);
//	TM_USART_Puts(USART6,"MAC: %02X-%02X-%02X-%02X-%02X-%02X\n",
//		TM_ETHERNET_GetMACAddr(0),
//		TM_ETHERNET_GetMACAddr(1),
//		TM_ETHERNET_GetMACAddr(2),
//		TM_ETHERNET_GetMACAddr(3),
//		TM_ETHERNET_GetMACAddr(4),
//		TM_ETHERNET_GetMACAddr(5)
//	);
	/* Print netmask to user */
	sprintf(str,"Netmask: %d.%d.%d.%d\n",
		TM_ETHERNET_GetGateway(0),
		TM_ETHERNET_GetGateway(1),
		TM_ETHERNET_GetGateway(2),
		TM_ETHERNET_GetGateway(3)
	);
	printf_d(str);
//	TM_USART_Puts(USART6,"Netmask: %d.%d.%d.%d\n",
//		TM_ETHERNET_GetGateway(0),
//		TM_ETHERNET_GetGateway(1),
//		TM_ETHERNET_GetGateway(2),
//		TM_ETHERNET_GetGateway(3)
//	);
	/* Print gateway to user */
	sprintf(str,"Gateway: %d.%d.%d.%d\n",
		TM_ETHERNET_GetNetmask(0),
		TM_ETHERNET_GetNetmask(1),
		TM_ETHERNET_GetNetmask(2),
		TM_ETHERNET_GetNetmask(3)
	);
	printf_d(str);
//	TM_USART_Puts(USART6,"Gateway: %d.%d.%d.%d\n",
//		TM_ETHERNET_GetNetmask(0),
//		TM_ETHERNET_GetNetmask(1),
//		TM_ETHERNET_GetNetmask(2),
//		TM_ETHERNET_GetNetmask(3)
//	);
	/* Print 100M link status, 1 = 100M, 0 = 10M */
	sprintf(str,"Link 100M: %d\n", TM_ETHERNET.speed_100m);
	printf_d(str);
//	TM_USART_Puts(USART6,"Link 100M: %d\n", TM_ETHERNET.speed_100m);
	/* Print duplex status: 1 = Full, 0 = Half */
	sprintf(str,"Full duplex: %d\n", TM_ETHERNET.full_duplex);
	printf_d(str);
//	TM_USART_Puts(USART6,"Full duplex: %d\n", TM_ETHERNET.full_duplex);
}

void TM_ETHERNET_LinkIsDownCallback(void) {
	/* This function will be called when ethernet cable will not be plugged */
	/* It will also be called on initialization if connection is not detected */
	
	/* Print to user */
	//sprintf(str,"Link is down, do you have connected to your modem/router?");
	//TM_USART_Puts(USART3,str);
}
void TM_ETHERNET_LinkIsUpCallback(void) {
	/* Cable has been plugged in back, link is detected */
	/* I suggest you that you reboot MCU here */
	/* Do important stuff before */
	
	/* Print to user */
		//sprintf(str,"Link is up back\n");
		//TM_USART_Puts(USART3,str);
}
/* Delay 1ms handler */
void TM_DELAY_1msHandler(void) {
	/* Time update for ethernet, 1ms */
	/* Add 1ms time for ethernet */
	TM_ETHERNET_TimeUpdate(1);
}
void vTimerCallback1( xTimerHandle  pxTimer )
 {
	long lArrayIndex;
     /* Optionally do something if the pxTimer parameter is NULL. */
     configASSERT( pxTimer );

     /* Which timer expired? */
     lArrayIndex = ( long ) pvTimerGetTimerID( pxTimer );

